function result (object) {
let a = 2;
let b = "apple";
let c = a;
a = b;
b = c;
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let sum = arr[0] + arr[9] + arr[4];
object = {a, b, sum};
console.log (result);
};

/* 3)	Создать функцию, в теле которой необходимо положить код из первого и второго задания, 
объявить объект в этой функции, в который необходимо положить значения двух переменных из первого задания 
с соответствующими названиями полей как у этих переменных и 
положить результат сложения из второго задания в поле sum. 
Вывести этот объект в консоль. Запустить эту функцию */